export const busStops = [
  {
    id: 1,
    name: "«32-й мкр. ул. 30 лет Победы»",
    times: ["05:25", "12:00", "20:35"],
  },
  {
    id: 2,
    name: "«Никольский» ул. И.Каролинского",
    times: ["05:30", "12:03", "20:39"],
  },
  {
    id: 3,
    name: "«ТЦ Росич» Комсомольский пр-т",
    times: ["05:36", "12:12", "20:44"],
  },
  {
    id: 4,
    name: "«Югорская»ул. М-Карамова",
    times: ["05:42", "12:17", "20:50"],
  },
  {
    id: 5,
    name: "м-н «Всё для дома»",
    times: ["05:45", "12:20", "20:53"],
  },
  {
    id: 6,
    name: "«Преображенский Храм»",
    times: ["05:47", "12:22", "20:56"],
  },
  {
    id: 7,
    name: "«Дом Советов»",
    times: ["05:53", "12:30", "21:00"],
  },
  {
    id: 8,
    name: "«Энергетиков» б-р Свободы",
    times: ["05:55", "12:32", "21:03"],
  },
  {
    id: 9,
    name: "«ДК Строитель»",
    times: ["05:58", "12:35", "21:06"],
  },
  {
    id: 10,
    name: "«Школа № 15» ул. Пушкина",
    times: ["06:05", "12:44", "21:12"],
  },
  {
    id: 11,
    name: "«Банк Уралсиб»",
    times: ["06:08", "12:47", "21:15"],
  },
  {
    id: 12,
    name: "«Школа № 1» ул. Островского",
    times: ["06:10", "12:51", "21:18"],
  },
  {
    id: 13,
    name: "«Агенство воздушных сообщений»",
    times: ["06:11", "12:52", "21:19"],
  },
  {
    id: 14,
    name: "«Бахилова» пр-т Ленина",
    times: ["06:12", "12:54", "21:21"],
  },
  {
    id: 15,
    name: "«Дзержинского» ул. Дзержинского",
    times: ["06:13", "12:56", "21:23"],
  },
  {
    id: 16,
    name: "«Гостиница Обь»",
    times: ["06:14", "13:01", "21:25"],
  },
  {
    id: 17,
    name: "«Стоматология № 1» ул. Кукуевицкого",
    times: ["06:17", "13:04", "21:28"],
  },
  {
    id: 18,
    name: "«УБР» пр-кт Ленина",
    times: ["06:19", "13:06", "21:32"],
  },
  {
    id: 19,
    name: "«Нефть Приобья» 37-й мкр-рн",
    times: ["06:23", "13:09", "21:35"],
  },
  {
    id: 20,
    name: "«Киртбая» 37-й мкр-рн",
    times: ["06:24", "13:10", "21:36"],
  },
  {
    id: 21,
    name: "«37-й мкр-рн» Югорский т-кт",
    times: ["06:27", "13:13", "21:39"],
  },
  {
    id: 22,
    name: "«Грибоедова» ул. Крылова",
    times: ["06:32", "13:18", "21:44"],
  },
  {
    id: 23,
    name: "«микрорайон ПИКС» ул. Крылова",
    times: ["06:34", "13:20", "21:46"],
  },
  {
    id: 24,
    name: "«Александрия» ул. Крылова",
    times: ["06:35", "13:21", "21:47"],
  },
  {
    id: 25,
    name: "«Аэропорт»",
    times: ["06:48", "13:34", "21:50"],
  },
];

export const usersAuth = [
  {id: 0,
    name: 'Иванов Иван',
    login: 'IvIv',
    password: 'hashedpassword'
  },
  {
    id: 1,
    name: 'Виктор Викторович',
    login: 'ViVi',
    password: 'passwordhashed'
  },
  {
    id: 2,
    name: 'Олег Олегович',
    login: 'OlOl',
    password: 'passwordhashed'
  }
]

export const users = [
  {
  id: 0,
  name: 'Иванов Иван',
  phone: '+1-234-567-89-00',
  stops: [
    {
      id: 0,
      date: 'today',
      shift: '1',
      stopId: '0',
      stopName: '«32-й мкр. ул. 30 лет Победы»',
      selectedAt: '25.05.2025 11:10:49',
      busExpectedTime: '12:00'
    },
    {
      id: 1,
      date: 'tomorrow',
      shift: '2',
      stopId: '0',
      stopName: '«32-й мкр. ул. 30 лет Победы»',
      selectedAt: '25.05.2025 11:12:49',
      busExpectedTime: '20:35'
    },
  ]
},

{
  id: 2,
  name: 'Иванов Иван',
  phone: '+1-234-567-89-00',
  stops: []
},
]

export const busStopsActual = [
  {
    id: 1,
    name: "«32-й мкр. ул. 30 лет Победы»",
    times: ["05:25", "12:00", "20:35"],
    timeChanged: ['', '', '20:40'],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
]
  },
  {
    id: 2,
    name: "«Никольский» ул. И.Каролинского",
    times: ["05:30", "12:03", "20:39"],
    timeChanged: ['', '', ''],
    passengers: [

]
  },
  {
    id: 3,
    name: "«ТЦ Росич» Комсомольский пр-т",
    times: ["05:36", "12:12", "20:44"],
    timeChanged: ['', '', ''],
    passengers: [

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 4,
    name: "«Югорская»ул. М-Карамова",
    times: ["05:42", "12:17", "20:50"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 5,
    name: "м-н «Всё для дома»",
    times: ["05:45", "12:20", "20:53"],
    timeChanged: ['', '', ''],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 6,
    name: "«Преображенский Храм»",
    times: ["05:47", "12:22", "20:56"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 7,
    name: "«Дом Советов»",
    times: ["05:53", "12:30", "21:00"],
    timeChanged: ['', '', ''],
    passengers: [
]
  },
  {
    id: 8,
    name: "«Энергетиков» б-р Свободы",
    times: ["05:55", "12:32", "21:03"],
    timeChanged: ['', '', ''],
    passengers: [

]
  },
  {
    id: 9,
    name: "«ДК Строитель»",
    times: ["05:58", "12:35", "21:06"],
    timeChanged: ['', '', ''],
    passengers: [

]
  },
  {
    id: 10,
    name: "«Школа № 15» ул. Пушкина",
    times: ["06:05", "12:44", "21:12"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 11,
    name: "«Банк Уралсиб»",
    times: ["06:08", "12:47", "21:15"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

]
  },
  {
    id: 12,
    name: "«Школа № 1» ул. Островского",
    times: ["06:10", "12:51", "21:18"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

  "Николаев Николай",
]
  },
  {
    id: 13,
    name: "«Агенство воздушных сообщений»",
    times: ["06:11", "12:52", "21:19"],
    timeChanged: ['', '', ''],
    passengers: [

]
  },
  {
    id: 14,
    name: "«Бахилова» пр-т Ленина",
    times: ["06:12", "12:54", "21:21"],
    timeChanged: ['', '', ''],
    passengers: [

]
  },
  {
    id: 15,
    name: "«Дзержинского» ул. Дзержинского",
    times: ["06:13", "12:56", "21:23"],
    timeChanged: ['', '', ''],
    passengers: [

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 16,
    name: "«Гостиница Обь»",
    times: ["06:14", "13:01", "21:25"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

  "Николаев Николай",
]
  },
  {
    id: 17,
    name: "«Стоматология № 1» ул. Кукуевицкого",
    times: ["06:17", "13:04", "21:28"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

]
  },
  {
    id: 18,
    name: "«УБР» пр-кт Ленина",
    times: ["06:19", "13:06", "21:32"],
    timeChanged: ['', '', ''],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 19,
    name: "«Нефть Приобья» 37-й мкр-рн",
    times: ["06:23", "13:09", "21:35"],
    timeChanged: ['', '', ''],
    passengers: [

]
  },
  {
    id: 20,
    name: "«Киртбая» 37-й мкр-рн",
    times: ["06:24", "13:10", "21:36"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 21,
    name: "«37-й мкр-рн» Югорский т-кт",
    times: ["06:27", "13:13", "21:39"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 22,
    name: "«Грибоедова» ул. Крылова",
    times: ["06:32", "13:18", "21:44"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

]
  },
  {
    id: 23,
    name: "«микрорайон ПИКС» ул. Крылова",
    times: ["06:34", "13:20", "21:46"],
    timeChanged: ['', '', ''],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 24,
    name: "«Александрия» ул. Крылова",
    times: ["06:35", "13:21", "21:47"],
    timeChanged: ['', '', ''],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 25,
    name: "«Аэропорт»",
    times: ["06:48", "13:34", "21:50"],
    timeChanged: ['', '', ''],
    passengers: [
  "Иванов Иван",

  "Николаев Николай",
]
  },
];