export const busStops = [
  {
    id: 1,
    name: "«32-й мкр. ул. 30 лет Победы»",
    times: ["05:25", "12:00", "20:35"],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
]
  },
  {
    id: 2,
    name: "«Никольский» ул. И.Каролинского",
    times: ["05:30", "12:03", "20:39"],
    passengers: [

]
  },
  {
    id: 3,
    name: "«ТЦ Росич» Комсомольский пр-т",
    times: ["05:36", "12:12", "20:44"],
    passengers: [

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 4,
    name: "«Югорская»ул. М-Карамова",
    times: ["05:42", "12:17", "20:50"],
    passengers: [
  "Иванов Иван",

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 5,
    name: "м-н «Всё для дома»",
    times: ["05:45", "12:20", "20:53"],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 6,
    name: "«Преображенский Храм»",
    times: ["05:47", "12:22", "20:56"],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 7,
    name: "«Дом Советов»",
    times: ["05:53", "12:30", "21:00"],
    passengers: [
  "Иванов Иван",

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 8,
    name: "«Энергетиков» б-р Свободы",
    times: ["05:55", "12:32", "21:03"],
    passengers: [

]
  },
  {
    id: 9,
    name: "«ДК Строитель»",
    times: ["05:58", "12:35", "21:06"],
    passengers: [
  "Иванов Иван",
  "Александров Александр",

  "Николаев Николай",
]
  },
  {
    id: 10,
    name: "«Школа № 15» ул. Пушкина",
    times: ["06:05", "12:44", "21:12"],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 11,
    name: "«Банк Уралсиб»",
    times: ["06:08", "12:47", "21:15"],
    passengers: [
  "Иванов Иван",

]
  },
  {
    id: 12,
    name: "«Школа № 1» ул. Островского",
    times: ["06:10", "12:51", "21:18"],
    passengers: [
  "Иванов Иван",

  "Николаев Николай",
]
  },
  {
    id: 13,
    name: "«Агенство воздушных сообщений»",
    times: ["06:11", "12:52", "21:19"],
    passengers: [

]
  },
  {
    id: 14,
    name: "«Бахилова» пр-т Ленина",
    times: ["06:12", "12:54", "21:21"],
    passengers: [

]
  },
  {
    id: 15,
    name: "«Дзержинского» ул. Дзержинского",
    times: ["06:13", "12:56", "21:23"],
    passengers: [

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 16,
    name: "«Гостиница Обь»",
    times: ["06:14", "13:01", "21:25"],
    passengers: [
  "Иванов Иван",

  "Николаев Николай",
]
  },
  {
    id: 17,
    name: "«Стоматология № 1» ул. Кукуевицкого",
    times: ["06:17", "13:04", "21:28"],
    passengers: [
  "Иванов Иван",

]
  },
  {
    id: 18,
    name: "«УБР» пр-кт Ленина",
    times: ["06:20", "13:06", "21:32"],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 19,
    name: "«Нефть Приобья» 37-й мкр-рн",
    times: ["06:23", "13:09", "21:35"],
    passengers: [

]
  },
  {
    id: 20,
    name: "«Киртбая» 37-й мкр-рн",
    times: ["06:24", "13:10", "21:36"],
    passengers: [
  "Иванов Иван",
  "Александров Александр",
  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 21,
    name: "«37-й мкр-рн» Югорский т-кт",
    times: ["06:27", "13:13", "21:39"],
    passengers: [
  "Иванов Иван",

  "Павлов Павел",
  "Николаев Николай",
]
  },
  {
    id: 22,
    name: "«Грибоедова» ул. Крылова",
    times: ["06:32", "13:18", "21:44"],
    passengers: [
  "Иванов Иван",

]
  },
  {
    id: 23,
    name: "«микрорайон ПИКС» ул. Крылова",
    times: ["06:34", "13:20", "21:46"],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 24,
    name: "«Александрия» ул. Крылова",
    times: ["06:35", "13:21", "21:47"],
    passengers: [

  "Николаев Николай",
]
  },
  {
    id: 25,
    name: "«Аэропорт»",
    times: ["06:48", "13:34", "21:50"],
    passengers: [
  "Иванов Иван",

  "Николаев Николай",
]
  },
];